Обработки/Reports/_ДвиженияДенежныхСредствФОГФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ДвиженияДенежныхСредствФОГФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ДвиженияДенежныхСредствФОГФ/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");	
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Отчет, "Период,Организация,СчетДоверительногоУправления,РасчетныйСчет");
	Механизм = ОтчетОбъект.Метаданные().ПолноеИмя();
    Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);	
	
	ЭтаФорма.Результат.Очистить();
	
	Макет = ОтчетОбъект.ПолучитьМакет("Отчет");
	
	// шапка
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.НомерДоговора КАК ПечНомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	ЮрЛицоОрганизации.ПолноеНаименованиеПоУставу КАК ПечПолноеНаименованиеУК,
		|	РеквизитыАнкетныеФОГФ.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеФОГФ,
		|	БанковскиеСчета.НомерСчета КАК ПечНомерСчета,
		|	ПРЕДСТАВЛЕНИЕ(БанковскиеСчета.Валюта) КАК ПечВалютаСчета,
		|	ЕСТЬNULL(НачОстатокДенежныхСредств.СуммаОстаток, 0) КАК ПечВходящийОстаток,
		|	ЕСТЬNULL(КонОстатокДенежныхСредств.СуммаОстаток, 0) КАК ПечИсходящийОстаток
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&НачДата,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК ЮрЛицоОрганизации
		|		ПО СчетаДоверительногоУправления.Организация.ЮрФизЛицо = ЮрЛицоОрганизации.ЮрФизЛицо
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО (БанковскиеСчета.Ссылка = &РасчетныйСчет)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|				&НачДата,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И РасчетныйСчет = &РасчетныйСчет) КАК НачОстатокДенежныхСредств
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|				&КонДата,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И РасчетныйСчет = &РасчетныйСчет) КАК КонОстатокДенежныхСредств
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&КонДата,
		|				Организация = &Организация
		|					И ЮрФизЛицо = &ФОГФ
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыАнкетныеФОГФ
		|		ПО (ИСТИНА)
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("НачДата",                      НачалоДня(Отчет.Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонДата",                      КонецДня(Отчет.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",                  Отчет.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Отчет.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("РасчетныйСчет",                Отчет.РасчетныйСчет);
	Запрос.УстановитьПараметр("ФОГФ",						  ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_ФОГФ"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Выборка);
	
	ОбластьМакета.Параметры.ПечНачПериода   		 = Формат(Отчет.Период.ДатаНачала, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.ПечКонПериода   		 = Формат(Отчет.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.ПечДатаДоговора 		 = Формат(Выборка.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	ОбластьМакета.Параметры.ПолноеНаименованиеФОГФРП = ПолучитьСклоненияСтроки(Выборка.ПолноеНаименованиеФОГФ, "", "ПД=Родительный")[0];
	
	ЭтаФорма.Результат.Вывести(ОбластьМакета);
	
	// табличная часть
	ПечИтогоЗачислено = 0;
	ПечИтогоСписано   = 0;
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиДенежныхСредствОбороты.Период КАК Период,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения ЕСТЬ NULL
		|			ТОГДА ОстаткиДенежныхСредствОбороты.СуммаПриход
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|					ТОГДА РеестрПлатежей.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ПечЗачислено,
		|	ВЫБОР
		|		КОГДА РеестрПлатежей.ВидДвижения ЕСТЬ NULL
		|			ТОГДА ОстаткиДенежныхСредствОбороты.СуммаРасход
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РеестрПлатежей.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|					ТОГДА РеестрПлатежей.Сумма
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК ПечСписано,
		|	РеестрПлатежей.СтрокаБанковскойВыписки.НазначениеПлатежа КАК ПечНазначениеПлатежа
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Обороты(
		|			&НачДата,
		|			&КонДата,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И РасчетныйСчет = &РасчетныйСчет) КАК ОстаткиДенежныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрПлатежей КАК РеестрПлатежей
		|		ПО ОстаткиДенежныхСредствОбороты.Регистратор = РеестрПлатежей.Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиДенежныхСредствОбороты.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();     
	
	Пока Выборка.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, Выборка);
		ОбластьМакета.Параметры.ПечДата = Формат(Выборка.Период, "ДФ=dd.MM.yyyy");
		
		ЭтаФорма.Результат.Вывести(ОбластьМакета);
				
		ПечИтогоЗачислено = ПечИтогоЗачислено + Выборка.ПечЗачислено;
		ПечИтогоСписано   = ПечИтогоСписано + Выборка.ПечСписано;
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаИтогоТаблицы");
	ОбластьМакета.Параметры.ПечИтогоЗачислено = ПечИтогоЗачислено;
	ОбластьМакета.Параметры.ПечИтогоСписано   = ПечИтогоСписано;
	
	ЭтаФорма.Результат.Вывести(ОбластьМакета);
	
	// подвал
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	ДополнительныеСвойства = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;
	Если ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица") Тогда
		СтруктураДанныхРуководитель = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхКонтактногоЛица;
	Иначе
		СтруктураДанныхРуководитель = Неопределено;
	КонецЕсли;	
	
	Если ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера") Тогда
		СтруктураДанныхГлавбух = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхГлБухгалтера;
	Иначе	
		СтруктураДанныхГлавбух = Неопределено;
	КонецЕсли;
	
	Если СтруктураДанныхРуководитель <> Неопределено Тогда 
		ОбластьМакета.Параметры.ДолжностьРуководитель = СтруктураДанныхРуководитель.Должность + " (на основании " + СтруктураДанныхРуководитель.ОснованиеПолномочий +  ")";
		ОбластьМакета.Параметры.Руководитель = СтруктураДанныхРуководитель.КонтактноеЛицо;
	КонецЕсли;
	Если СтруктураДанныхГлавбух <> Неопределено Тогда 	
		ОбластьМакета.Параметры.ДолжностьГлавбух = СтруктураДанныхГлавбух.Должность;
		ОбластьМакета.Параметры.ГлавныйБухгалтер = СтруктураДанныхГлавбух.КонтактноеЛицо;
	КонецЕсли;
		
	ЭтаФорма.Результат.Вывести(ОбластьМакета);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ЭтаФорма.Результат, ОтчетОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КомандаСформироватьНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОтчетаНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОтчетаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	РаботаСОтчетамиКлиент.ПодписантОтчетаПриИзменении(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ГлБухгалтерПриИзменении(Элемент)
	
	ДополнительныеСвойства = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;		
	
	Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера") Тогда
		ДополнительныеСвойства.Вставить("СтруктураДанныхГлБухгалтера");	
	КонецЕсли;	
	
	РаботаСОтчетамиКлиент.ПодписантПриИзменении(ЭтаФорма.ГлБухгалтер, ДополнительныеСвойства.СтруктураДанныхГлБухгалтера);
	
КонецПроцедуры

&НаКлиенте
Процедура ГлБухгалтерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, ГлБухгалтер));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ГлБухгалтерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДополнительныеСвойства = ЭтаФорма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;		
	
	Если Не ДополнительныеСвойства.Свойство("СтруктураДанныхГлБухгалтера") Тогда
		ДополнительныеСвойства.Вставить("СтруктураДанныхГлБухгалтера");	
	КонецЕсли;	
	
	РаботаСОтчетамиКлиент.ПодписантОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение, ДополнительныеСвойства.СтруктураДанныхГлБухгалтера, ЭтаФорма.Отчет.Организация);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";

	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Подписант) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран ответственный",,, "Подписант", Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГлБухгалтер) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран главный бухгалтер",,, "ГлБухгалтер", Отказ);
	КонецЕсли;
	
КонецПроцедуры
